In this notebook, you'll see how to connect to a Postgres database using the sqlalchemy library.

For this notebook, you'll need both the sqlalchemy and psycopg2 libraries installed.

In [1]:
from sqlalchemy import create_engine

In [2]:
import pandas as pd

In [3]:
database_name = 'scooters'    # Fill this in with your scooter database name

connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"

First, we need to create a connection string. The format is

<dialect(+driver)>://<username>:<password>@<hostname>:<port>/<database>

To connect to the Lahman baseball database, you can use the following connection string.

In [4]:
database_name = 'scooters'    # Fill this in with your scooter database name

connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"

Now, we need to create an engine and use it to connect.

In [5]:
engine = create_engine(connection_string)

3. The goal of Metro Nashville is to have each scooter used a minimum of 3 times per day. Based on the data, what is the average number of trips per scooter per day? Make sure to consider the days that a scooter was available. How does this vary by company?

In [6]:
available_and_used = '''
with count_of_scooters as (SELECT companyname, sumdid, COUNT(sumdid) as num_of_times_used, DATE(pubtimestamp) as date
                            FROM trips
                            GROUP BY companyname, sumdid, date)
SELECT sumdid, companyname, ROUND(SUM(num_of_times_used)/COUNT(date),2) AS count_per_day
FROM count_of_scooters
GROUP BY 1, 2

'''
result = engine.execute(available_and_used)

a_and_u = pd.read_sql(available_and_used, con = engine)
a_and_u

              sumdid companyname  count_per_day
0      Powered262765        Lyft           2.83
1       PoweredJUYYK        Bird           2.05
2       PoweredUGUDV        Bird           2.00
3       PoweredTUDY3        Bird           2.17
4      Powered703525        Lyft           2.53
...              ...         ...            ...
9000  Powered5439706        SPIN           2.30
9001  Powered8027632        SPIN           2.24
9002   Powered994200        Lyft           3.05
9003  Powered9439811        SPIN           2.39
9004  Powered5515010        SPIN           2.33

[9005 rows x 3 columns]

In [7]:
cte = '''
with count_of_scooters as (SELECT companyname, sumdid, COUNT(sumdid) as num_of_times_used, DATE(pubtimestamp) as date
                            FROM trips
                            GROUP BY companyname, sumdid, date),

					   second_query as	(SELECT sumdid, companyname, ROUND(SUM(num_of_times_used)/COUNT(date),2) AS count_per_day
							FROM count_of_scooters
							GROUP BY 1, 2)
SELECT companyname, ROUND(AVG(count_per_day),2)
FROM second_query
GROUP BY 1
'''

result = engine.execute(cte)

count_for_company = pd.read_sql(cte, con = engine)
count_for_company

     companyname  round
0           Bird   1.91
1  Bolt Mobility   2.34
2         Gotcha   2.52
3           JUMP   1.92
4           Lime   4.05
5           Lyft   3.04
6           SPIN   2.06